k6-smoke-test-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/load/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 14 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 29 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 35 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 39 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 59 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 112 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 119 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 124 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 129 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 136 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 143 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 163 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 175 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s

running (0m31.0s), 02/10 VUs, 183 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s

running (0m32.0s), 01/10 VUs, 184 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s
time="2025-11-29T10:21:28-05:00" level=info msg="Load test completed" source=console


  █ THRESHOLDS 

    api_latency
    ✓ 'p(95)<500' p(95)=0

    auth_latency
    ✓ 'p(95)<1000' p(95)=15.3

    errors
    ✗ 'rate<0.05' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=12.3ms
    ✓ 'p(99)<1000' p(99)=26.39ms

    http_req_failed
    ✗ 'rate<0.01' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 134     4.162883/s
    checks_succeeded...: 0.00%   0 out of 134
    checks_failed......: 100.00% 134 out of 134

    ✗ login status is 200
      ↳  0% — ✓ 0 / ✗ 55
    ✗ login returns token
      ↳  0% — ✓ 0 / ✗ 55
    ✗ health check status is 200
      ↳  0% — ✓ 0 / ✗ 12
    ✗ health check returns ok
      ↳  0% — ✓ 0 / ✗ 12

    CUSTOM
    api_latency..........: avg=0        min=0      med=0      max=0       p(90)=0      p(95)=0     
    auth_latency.........: avg=6.636364 min=4      med=5      max=24      p(90)=13     p(95)=15.3  
    errors...............: 100.00% 185 out of 185
    failed_logins........: 55      1.708646/s

    HTTP
    http_req_duration....: avg=5.96ms   min=3.46ms med=4.72ms max=32.02ms p(90)=7.85ms p(95)=12.3ms
    http_req_failed......: 100.00% 185 out of 185
    http_reqs............: 185     5.747264/s

    EXECUTION
    iteration_duration...: avg=1.64s    min=1s     med=1.01s  max=5.01s   p(90)=2.01s  p(95)=5s    
    iterations...........: 185     5.747264/s
    vus..................: 1       min=1          max=10
    vus_max..............: 10      min=10         max=10

    NETWORK
    data_received........: 168 kB  5.2 kB/s
    data_sent............: 42 kB   1.3 kB/s



running (0m32.2s), 00/10 VUs, 185 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s
time="2025-11-29T10:21:28-05:00" level=error msg="thresholds on metrics 'errors, http_req_failed' have been crossed"